datapost.xml

 "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:sub=\"http://services.omx.truecorp.co.th/SubmitOrder\">" +
		"<soapenv:Header/>" +
		"<soapenv:Body>" +
		"<submitOrderRequest xmlns=\"http://services.omx.truecorp.co.th/SubmitOrder\" xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\">" +
		"<Order>" +
		"<channel>BN_TVS</channel>" +
		"<orderId>tvs22334</orderId>" +
		"<orderType>124</orderType>" +
		"<effectiveDate>2016-06-02T00:00:00</effectiveDate>" +
		"<dealerCode>90002311</dealerCode>" +
		"</Order>" +
		"<Customer>" +
		"<customerId>42075</customerId>" +
		"<Account>" +
		"<accountId>11024042</accountId>" +
		"</Account>" +
		"<OU>" +
		"<ouId>32682</ouId>" +
		"<subscriber>" +
		"<status>65</status>" +
		"<activityInfo>" +
		"<activityReason>T007</activityReason>" +
		"<userText>BN_TVS</userText>" +
		"</activityInfo>" +
		"<payChannelIdPrimary>225523303</payChannelIdPrimary>" +
		"<payChannelIdSecondary>225523303</payChannelIdSecondary>" +
		"<resourceInfo>" +
		"<resourceCategory>R</resourceCategory>" +
		"<resourceName>Television ID</resourceName>" +
		"<valuesArray>21928333</valuesArray>" +
		"</resourceInfo>" +
		"<subscriberAddress>" +
		"<amphur>บางพลัด</amphur>" +
		"<buildingName/>" +
		"<city>กรุงเทพมหานคร</city>" +
		"<country>THA</country>" +
		"<floor/>" +
		"<houseNo>580/73</houseNo>" +
		"<moo/>" +
		"<roomNo/>" +
		"<soi>จรัลสนิทวงศ์ 71</soi>" +
		"<subSoi/>" +
		"<streetName>จรัลสนิทวงศ์</streetName>" +
		"<timeAtAddress>0101</timeAtAddress>" +
		"<tumbon>บางพลัด</tumbon>" +
		"<typeOfAccomodation>OWN</typeOfAccomodation>" +
		"<zip>10700</zip>" +
		"</subscriberAddress>" +
		"<subscriberGeneralInfo>" +
		"<language>TH</language>" +
		"<smsLang>TH</smsLang>" +
		"</subscriberGeneralInfo>" +
		"<subscriberId>53270364</subscriberId>" +
		"<subscriberIndyName>" +
		"<identification>3420900804468</identification>" +
		"<identificationType>3</identificationType>" +
		"<language>TH</language>" +
		"<homePhone>084-5443462,</homePhone>" +
		"<title>T5PSPคุณ</title>" +
		"<firstName>ชัยวัฒน์</firstName>" +
		"<lastName>ชัชวาลย์</lastName>" +
		"<gender>O</gender>" +
		"</subscriberIndyName>" +
		"<subscriberNumber>21928333</subscriberNumber>" +
		"<subscriberType>VC</subscriberType>" +
		"<ExtendedInfo>" +
		"<name>PRIMARY_RESOURCE_TYPE</name>" +
		"<value>UICC</value>" +
		"</ExtendedInfo>" +
		"</subscriber>" +
		"</OU>" +
		"</Customer>" +
		"</submitOrderRequest>" +
		"</soapenv:Body>" +
		"</soapenv:Envelope>"